#+TITLE configuration for teaching emacs

The table of contents is automatically generated by having the tag :TOC: (see toc-org below)

** yasnippets

Saves typing and remembering obscure options. See snippets directory.

#+begin_src emacs-lisp
(use-package "yasnippet"
  :ensure t
  :config
  (yas-global-mode 1)  ; enable it everywhere
  )
#+end_src

#+begin_src emacs-lisp
(defun yas/org-src-lang ()
  "Try to find the current language of the src/header at point.
Return nil otherwise."
  (save-excursion
    (pcase
        (downcase
         (buffer-substring-no-properties
          (goto-char (line-beginning-position))
          (or (ignore-errors (1- (search-forward " " (line-end-position))))
              (1+ (point)))))
      ("#+property:"
       (when (re-search-forward "header-args:")
         (buffer-substring-no-properties
          (point)
          (or (and (forward-symbol 1) (point))
              (1+ (point))))))
      ("#+begin_src"
       (buffer-substring-no-properties
        (point)
        (or (and (forward-symbol 1) (point))
            (1+ (point)))))
      ("#+header:"
       (search-forward "#+begin_src")
       (+yas/org-src-lang))
      (_ nil))))

(defun yas/org-last-src-lang ()
  (interactive)
  (save-excursion
    (beginning-of-line)
    (when (search-backward "#+begin_src" nil t)
      (yas/org-src-lang))))
#+end_src

#+RESULTS:
#+begin_example
yas/org-last-src-lang
#+end_example


* function to start presenting

- Do any per-buffer configuration here. Sets margins, interspacing, font size.
- It can be called by org-mode-hook
- change values to your preference

#+begin_src emacs-lisp
(defun lecture-start ()
  (interactive)
  (visual-line-mode 1)
  (dmg-font-size 24)
  (setq left-margin-width 10)
;  (setq right-margin-width 10)  ; i don't find right margins very useful
  (setq line-spacing 0.2)
  (set-window-buffer nil (current-buffer)) ;; margins only take effect after this
  )

(defun lecture-end ()
  (interactive)
  (dmg-font-size 16) 
  (setq left-margin-width 0)
  (setq right-margin-width 0)  
  (setq line-spacing 0.1)
  (set-window-buffer nil (current-buffer)) ;; margins only take effect after this
  )


#+end_src

#+RESULTS:
#+begin_example
lecture-end
#+end_example

* Using xournal to annotate blocks

- If you have xournal and a tablet, you can use it, but not in emacs :(

This code is a bit brittle.

- You must have xournal installed and in the path
- It also requires ps2pdf
- PDF files are created in the emacs temp directory 

#+BEGIN_SRC emacs-lisp
(require 'ps-print)
(when (executable-find "ps2pdf")
  (defun dmg-pdf-print-buffer-with-faces (pdf-name)
    "Print file in the current buffer as pdf, including font, color, and
underline information.  This command works only if you are using a window system,
so it has a way to determine color values.

C-u COMMAND prompts user where to save the Postscript file (which is then
converted to PDF at the same location."
    (let*
        ((ps-name (concat (make-temp-file "x-org-block-") ".ps")))
      (setq ps-print-header nil)
      (setq ps-print-footer nil)
      (setq ps-line-spacing 3)
      (setq ps-font-size 14)
;      (setq ps-landscape-mode t)
      (ps-print-with-faces (point-min) (point-max) ps-name)
      ;; build command line.. make sure to include spaces and escape parameters
      (shell-command (concat "ps2pdf "  (shell-quote-argument ps-name) " " (shell-quote-argument pdf-name)))
      (delete-file ps-name)
      (message "Wrote %s" pdf-name) pdf-name ) ))
#+END_SRC

#+RESULTS:
#+begin_example
dmg-pdf-print-buffer-with-faces
#+end_example

#+BEGIN_SRC emacs-lisp
(require 'ps-print)
(when (and (executable-find "ps2pdf")
           (executable-find "xournal"))
  (defun dmg-xournal-block-edit ()
    "Print file in the current buffer as pdf then load into xournal"
    (interactive)
    (let* 
        ((pdf-name (concat (make-temp-file "x-org-block-") ".pdf")))
      (save-restriction
      (org-narrow-to-block)
      (dmg-pdf-print-buffer-with-faces pdf-name)
      (message "Starting xournal on file %s" pdf-name)
      (start-process "xournal-prog" "ripp" "xournal" pdf-name)
      ))))
#+END_SRC

#+RESULTS:
#+begin_example
dmg-xournal-block-edit
#+end_example


